app/controllers/gigs_controller.rb

	 def create
    @gig = current_user.gigs.build(gig_params)


    if @gig.save
---
INSERT INTO "gigs" ("name", "description", "budget", "location", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "s"], ["description", "a"], ["budget", 122], ["location", "s"], ["created_at", 2018-04-08 16:30:56 UTC], ["updated_at", 2018-04-08 16:30:56 UTC], ["user_id", 5]]